{
  "content": "TERMS & CONDITIONS<br/>By registering for the Jewish Men’s Retreat (\"JMR28\"), you are acknowledging that you have read, accept, and agree to the following Terms and Conditions:<br/>1. PAYMENT DEADLINE:<br/>Full payment of the registration fees for JMR28 is due by no later than September 15, 2019.<br/>2. CANCELLATION POLICY<br/>Payments made will be refunded in full (less a $50 processing fee per person) if Menschwork, Inc. receives written notice of cancellation at JMR28@menschwork.org no later than noon on Friday, October 11, 2019.  Cancellations received after noon on Friday, October 11, 2019 and before noon on Friday, October 18, 2019 shall receive a 50% refund (less a $50 processing fee per person).  No refund is available if you cancel after noon on Friday, October 18, 2019, if you do not show up for JMR28, or if you leave early for any reason. This policy applies even if the cancellation is for medical reasons.<br/>Menschwork, Inc. reserves the right to cancel the program at any time. In the event of such a cancellation, you will receive a complete refund.<br/>Inclement Weather: Menschwork, Inc. reserves the right to cancel a retreat due to inclement weather if, in its judgment, it will be unable to operate safely. In the event of such a cancellation, a full refund will be issued.  In the event that the retreat proceeds as scheduled, no refund will be available.<br/>3. PUBLICITY RELEASE<br/>Please be aware that while attending JMR28, authorized representatives of Menschwork, Inc. and/or Hazon (which operates the Isabella Freedman Jewish Retreat Center) may take photographs and/or sound/image/video recordings of participants for promotion of good will, public education, fundraising and/or promotional activities, and other related activities. By attending JMR28, you agree that Menschwork, Inc. and/or Hazon may take photographs that include your image and that such photographs and/or sound/image/video recordings may be used by Menschwork, Inc. and/or Hazon for promotional and informational purposes in our brochures, website, newsletters, and other publications and for other trade and advertising purposes.<br/>I hereby grant permission, without reservation, to Menschwork, Inc. and Hazon, to take or make and/or have taken or made of me and to use and to otherwise describe the same with or without my name or information about me, or any of its affiliated or beneficiary agencies, and I waive any right to inspect or approve the photograph(s), sound/image/video recordings or finished version(s) of works, including web site, incorporating the photograph(s) or sound/image/video recordings. No compensation is to be paid to me for the above, and I understand and agree that I am entitled to receive no compensation for the above.<br/>I hereby release Menschwork, Inc. and Hazon and each of their respective officers, trustees, agents, employees, independent contractors, licensees and assignees (including photographers), from all claims that I now have or in the future may have, relating to the above, including but not limited to any photographs, or sound/image/video recordings described above.<br/>I agree that Menschwork, Inc. and/or Hazon, as applicable, will be the sole owner of all tangible and intangible rights in the abovementioned photographs and sound/image/video recordings, with full power of disposition.<br/>If you wish not to consent to this Publicity Release policy, please email us at JMR28@menschwork.org, with \"PHOTO WITHHOLD\" as the subject line, provide your name and address, and make sure that you receive a confirmation notice stating that we have received your request.<br/>4. LIABILITY RELEASE AGREEMENT<br/>I hereby certify that I am physically fit and capable of participating in JMR28 and that I do not suffer from any condition, sickness or disease that would impair my ability to participate in JMR28 or that presents any danger to my wellbeing as the result of such participation.<br/>I represent and warrant that my choice to participate in JMR28 is knowing, voluntary, and made for my personal enjoyment. I assume all the foregoing risks and fully accept personal responsibility for all expenses, medical or otherwise, following any such damages, injury, permanent disability or death.<br/>I release and discharge Menschwork, Inc. and its directors, officers, members, employees, agents, successors and assigns, all of which are hereinafter referred to as “Releasees,” from and waive any and all liability to me (the “Participant”), my heirs and next of kin or any other person, for any and all claims, demands, losses, or damages, including death or damage to property, which, in whole or in part, arise from, relate to or are alleged to arise from or relate to JMR28, any and all related events and activities in which Participant is participating, including with respect to the facilities and any transportation provided to Participant during JMR28, or are caused or alleged to be caused in whole or part by the negligence of the Releasees or otherwise, and I covenant not to initiate any claim, lawsuit, court action or other legal proceeding or demand against the Releasees with respect thereto and I waive any right to do so; and I further agree that if, despite this Release Agreement, I, or anyone on my behalf, makes a claim against any of the Releasees, I WILL INDEMNIFY, SAVE AND HOLD HARMLESS each of the Releasees from any litigation expenses, attorneys' fees, loss, liability, damage or cost which any may incur as a result of such claim, to the fullest extent permitted by law.<br/>I recognize that I have an important personal obligation to conduct myself in a manner compatible with local laws and regulations, and will abide by all such laws, regulations, standards and policies and promise to act responsibly and with respect for persons and property with policies for conduct set forth in this Release Agreement. I understand that, if at any time during the duration of the Program I fail to honor this Release Agreement, Menschwork, Inc. may, in their sole discretion, immediately withdraw me from JMR28 or place any restrictions it may deem appropriate on my participation in JMR28.<br/>I certify that I am age 18 or older and competent to agree to this Liability Release Agreement. I further agree that this Liability Release agreement shall be binding on me, my legal representatives, heirs, and assigns. I have read this waiver and I fully understand its contents.   I understand and agree that this Liability Release Agreement may not be modified in any way and no oral or written representations can or will alter the contents of this document. I agree that this agreement shall be governed by the laws of the State of Pennsylvania, which shall be the forum for any lawsuits filed under or incident to this agreement or JMR28.<br/>I HAVE CAREFULLY READ, FULLY UNDERSTAND, AND FREELY AGREE TO THIS LIABILITY RELEASE AGREEMENT VOLUNTARILY AND WITHOUT ANY INDUCEMENT OR ASSURANCE OF ANY NATURE.  I INTEND THIS TO BE A COMPLETE AND UNCONDITIONAL RELEASE OF ALL LIABILITY TO THE GREATEST EXTENT ALLOWED BY LAW AND AGREE THAT, IF ANY PORTION OF THIS RELEASE AGREEMENT IS HELD TO BE INVALID, THE BALANCE, NOTWITHSTANDING, SHALL CONTINUE IN FULL FORCE AND EFFECT."
}
