{
  "content":"TERMS & CONDITIONS<br/>By registering for the Jewish Men’s Retreat (\"JMR34\"), you are acknowledging that you have read, accept, and agree to the following Terms and Conditions:<br/>1. PAYMENT DEADLINE:<br/>Full payment of the registration fees for JMR34 is due by no later than September 1, 2025.<br/>2. CANCELLATION POLICY<br/>Payments made will be refunded in full (less a $50 processing fee per person) if Menschwork, Inc. receives written notice of cancellation at JMR@menschwork.org no later than noon on Monday, September 29, 2025. No refund is available if you cancel after such date.<br/>Menschwork, Inc. reserves the right to cancel the program at any time. In the event of such a cancellation, you will receive a complete refund.<br/>Inclement Weather: Menschwork, Inc. reserves the right to cancel a retreat due to inclement weather if, in its judgment, it will be unable to operate safely. In the event of such a cancellation, a full refund will be issued.  In the event that the retreat proceeds as scheduled, no refund will be available.<br/>3. PUBLICITY RELEASE<br/>Please be aware that while attending JMR34, authorized representatives of Menschwork, Inc. may take photographs and/or sound/image/video recordings of participants for promotion of good will, public education, fundraising and/or promotional activities, and other related activities. By registering for JMR34, you agree that Menschwork, Inc. may take photographs that include your image and that such photographs and/or sound/image/video recordings may be used by Menschwork, Inc. for promotional and informational purposes in our brochures, website, newsletters, and other publications and for other trade and advertising purposes.<br/>In furtherance of the intention and purpose of Shabbat and Chag, and in accordance with Menschwork, Inc.’s Spiritual Practices Guidelines, photography should be avoided in public areas on Shabbat and Chag.<br/>You further grant permission, without reservation, to Menschwork, Inc. to take or make and/or have taken or made of you and to use and to otherwise describe the same with or without your name or information about you, or any of its affiliated or beneficiary agencies, and you waive any right to inspect or approve the photograph(s), sound/image/video recordings or finished version(s) of works, including web site, incorporating the photograph(s) or sound/image/video recordings. No compensation will be paid to you for the above, and you understand and agree that you are entitled to receive no compensation for the above.<br/>You also release Menschwork, Inc. and its officers, trustees, agents, employees, independent contractors, licensees and assignees (including photographers), from all claims that you now have or in the future may have, relating to the above, including but not limited to any photographs, or sound/image/video recordings described above.<br/>You further agree that Menschwork, Inc. will be the sole owner of all tangible and intangible rights in the abovementioned photographs and sound/image/video recordings, with full power of disposition.<br/>4. LIABILITY RELEASE AGREEMENT<br/>By registering for JMR34, you are confirming that you have read, acknowledge, and agree to the following statements:<br/>a. That you are physically fit and capable of participating in JMR34 and do not suffer from any condition, sickness or disease that would impair your ability to participate in JMR34 or that presents any danger to your wellbeing as the result of such participation.<br/>b. That you represent and warrant that your choice to participate in JMR34 is knowing, voluntary, and made for your personal enjoyment and that you assume all the foregoing risks and fully accept personal responsibility for all expenses, medical or otherwise, following any such damages, injury, permanent disability or death that you may incur.<br/>c. That you release and discharge Menschwork, Inc. and its directors, officers, members, employees, agents, successors and assigns, all of which are hereinafter referred to as “Releasees,” from and waive any and all liability to you (the “Participant”), your heirs and next of kin or any other person, for any and all claims, demands, losses, or damages, including death or damage to property, which, in whole or in part, arise from, relate to or are alleged to arise from or relate to JMR34, any and all related events and activities in which Participant is participating, including with respect to the facilities and any transportation provided to Participant during JMR34, or are caused or alleged to be caused in whole or part by the negligence of the Releasees or otherwise, and you covenant not to initiate any claim, lawsuit, court action or other legal proceeding or demand against the Releasees with respect thereto and you waive any right to do so; and you further agree that if, despite this Release Agreement, you, or anyone on your behalf, makes a claim against any of the Releasees, YOU WILL INDEMNIFY, SAVE AND HOLD HARMLESS each of the Releasees from any litigation expenses, attorneys' fees, loss, liability, damage or cost which any may incur as a result of such claim, to the fullest extent permitted by law.<br/>d. That you recognize that you have an important personal obligation to conduct yourself in a manner compatible with local laws and regulations, and you will abide by all such laws, regulations, standards and policies and promise to act responsibly and with respect for persons and property with policies for conduct set forth in this Release Agreement. You understand that, if at any time during the duration of the Program you fail to honor this Release Agreement, Menschwork, Inc. may, in its sole discretion, immediately withdraw you from JMR34 or place any restrictions it may deem appropriate on your participation in JMR34.<br/>e. You certify that you are age 18 or older and competent to agree to this Liability Release Agreement. You further agree that this Liability Release agreement shall be binding on you and your legal representatives, heirs, and assigns. You certify that you have read this waiver and fully understand its contents. You understand and agree that this Liability Release Agreement may not be modified in any way and no oral or written representations can or will alter the contents of this document. You agree that this agreement shall be governed by the laws of the Commonwealth of Pennsylvania, which shall be the forum for any lawsuits filed under or incident to this agreement or JMR34.<br/>f. YOU HAVE CAREFULLY READ, FULLY UNDERSTAND, AND FREELY AGREE TO THIS LIABILITY RELEASE AGREEMENT VOLUNTARILY AND WITHOUT ANY INDUCEMENT OR ASSURANCE OF ANY NATURE.  YOU INTEND THIS TO BE A COMPLETE AND UNCONDITIONAL RELEASE OF ALL LIABILITY TO THE GREATEST EXTENT ALLOWED BY LAW AND AGREE THAT, IF ANY PORTION OF THIS RELEASE AGREEMENT IS HELD TO BE INVALID, THE BALANCE, NOTWITHSTANDING, SHALL CONTINUE IN FULL FORCE AND EFFECT."
}
