{
  "content": "By signing this waiver, you are indicating that you agree to the following Cancellation Policy and Publicity Release:<br/>CANCELLATION POLICY<br/>Payments made will be refunded in full (less a $50 processing fee per person) if you cancel at least 7 days prior to the official start of the retreat. If you cancel between 6 and 3 days prior to the retreat, a 50% refund will be granted. No refund is available if you cancel within 48 hours of the retreat, if you do not show up, or if you leave early for any reason. This policy applies even if the cancellation is for medical reasons.<br/>Menschwork reserves the right to cancel the program at any time. In the event of such a cancellation, you will receive a complete refund.<br/>Inclement Weather: Menschwork reserves the right to cancel a retreat due to inclement weather if, in its judgment, it will be unable to operate safely. In the event of such a cancellation, a full refund will be issued. In the event that the retreat proceeds as scheduled, no refund will be available.<br/>Shuttle and Transportation Fees: A full transportation refund is available if you cancel a transportation reservation at least 3 days (72 hours) prior to the official start date of a retreat. No refund is available if you cancel within 72 hours of the retreat.<br/>Travel Insurance: We recommend you contact your travel agent to purchase travel insurance in the event that you need to cancel or change your travel plans.<br/>CHILDREN<br/>All children under the age of 13 must be supervised by an adult at all time.<br/>PUBLICITY RELEASE<br/>By checking the box below, you consent to the following publicity release. If you wish not to consent to this policy, please email us at jmr26@menschwork.org, with \"PHOTO WITHHOLD\" as the subject line, and make sure that you receive a confirmation notice stating that we have received your request.<br/>Please be aware that while you are attending events at Isabella Freedman, authorized representatives of Menschwork and/or Hazon may take photographs and/or sound/image/video recordings of participants and faculty for promotion of good will, public education, fundraising and/or promotional activities, and other related activities. By attending events at Isabella Freedman, you agree that Menschwork and/or Hazon may take photographs that include your image and that such photographs and/or sound/image/video recordings may be used by Menschwork and/or Hazon for promotional and informational purposes in our brochures, website, newsletters, and other publications and for other trade and advertising purposes.<br/>I hereby grant permission, without reservation, to Menschwork and Hazon, to take or make and/ or have taken or made of me and to use and to otherwise describe the same with or without my name or information about me, or any of its affiliated or beneficiary agencies, and I waive any right to inspect or approve the photograph(s), sound/image/video recordings or finished version(s) of works, including web site, incorporating the photograph(s) or sound/image/video recordings. No compensation is to be paid to me for the above, and I understand and agree that I am entitled to receive no compensation for the above.<br/>I hereby release Menschwork and Hazon and each of their respective officers, trustees, agents, employees, independent contractors, licensees and assignees (including photographers), from all claims that I now have or in the future may have, relating to the above, including but not limited to any photographs, or sound/image/video recordings described above.<br/>I agree that Menschwork and/or Hazon will be the sole owner of all tangible and intangible rights in the abovementioned photographs and sound/image/video recordings, with full power of disposition.<br/>WAIVER AGREEMENT<br/>I am of full age and competent to sign this waiver. I agree that this waiver shall be binding on me, my legal representatives, heirs, and assigns. I have read this waiver and I fully understand its contents."
}
